---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AreaCreationData Constructor
AreaCreationData Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AreaCreationData(Object) | Initializes a new instance of the AreaCreationData class |
|  | AreaCreationData(ViewPlan, UV) | The data needed to create a new area |

# See Also

AreaCreationData Class

AreaCreationData Members

Autodesk.Revit.Creation Namespace